Revit 2026 API

# FamilyInstanceCreationDataRotateAngle Property

---

Get or set the rotate angle of the FamilyInstance

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double RotateAngle { get; set; }
```
```vb
Public Property RotateAngle As Double
	Get
	Set
```
```cpp
public:
property double RotateAngle {
	double get ();
	void set (double value);
}
```
```fsharp
member RotateAngle : float with get, set
```

#### Property Value

Double

The FamilyInstance will rotate this angle when the instance is created.

#### Reference

FamilyInstanceCreationData Class

Autodesk.Revit.Creation Namespace